In [4]:
import pandas as pd

In [6]:
data = {
    "a": [1,2,3,4],
    "b": [4,5,6,7],
    "c": ["sudh", "krish", "hitesh", "navin"]
}

In [8]:
df = pd.DataFrame(data)

In [10]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [14]:
df.set_index('a', inplace=True)

In [16]:
df

   b       c
a
1  4    sudh
2  5   krish
3  6  hitesh
4  7   navin

In [20]:
df = df.reset_index()

In [22]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [26]:
data = {
    "a": [1,2,3,4],
    "b": [4,5,6,7],
    "c": ["sudh", "krish", "hitesh", "navin"]
}

df1 = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])

In [28]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [30]:
df1.reindex(['b', 'c', 'd', 'a'])

   a  b       c
b  2  5   krish
c  3  6  hitesh
d  4  7   navin
a  1  4    sudh

In [32]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [40]:
for i, j in df1.iterrows():
    print(j)

a       1
b       4
c    sudh
Name: a, dtype: object
a        2
b        5
c    krish
Name: b, dtype: object
a         3
b         6
c    hitesh
Name: c, dtype: object
a        4
b        7
c    navin
Name: d, dtype: object

In [46]:
for col_name, column in df1.items():
    print(col_name, column)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object

In [56]:
list(df1['a'])

[1, 2, 3, 4]

In [58]:
[i for i in df['a']]

[1, 2, 3, 4]

In [60]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [66]:
def test(x):
    return x.sum()
    
df1.apply(test)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [68]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [70]:
df2 = df1[['a', 'b']]

In [72]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [78]:
df2.applymap(lambda x : x**2)

/var/folders/rv/pw1qbgxd5xb8ks1_rywswp8m0000gn/T/ipykernel_82809/4004635628.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [80]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [82]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [84]:
df.sort_values('c')

   a  b       c
2  3  6  hitesh
1  2  5   krish
3  4  7   navin
0  1  4    sudh

In [86]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [90]:
df.sort_index(ascending=False)

   a  b       c
3  4  7   navin
2  3  6  hitesh
1  2  5   krish
0  1  4    sudh

In [100]:
pd.set_option("display.max_colwidth", 1000)
df3 = pd.DataFrame({"Desc": ["At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various free learning courses with valuable resources, practice questions and regular assessments. Enrol now to experience interactive learning and hands-on practical experience at PW Skills."]})

In [102]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Desc
0  At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...

In [106]:
pd.set_option("display.max_colwidth", 1000)
df3 = pd.DataFrame({"Desc": ["At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various free learning courses with valuable resources, practice questions and regular assessments. Enrol now to experience interactive learning and hands-on practical experience at PW Skills.", "hello, how are you", "welcome to the data science course"]})

In [108]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Desc
0  At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       hello, how are you
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       welcome to the data science course

In [110]:
df3['len'] = df3['Desc'].apply(len)

In [112]:
df3

,Desc,len
0,"At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...",1178
1,"hello, how are you",18
2,welcome to the data science course,34

In [118]:
t = "Welcome to the data science"
len(t.split())

5

In [122]:
df3['word_count'] = df3['Desc'].apply(lambda x : len(x.split()))

In [124]:
df3

,Desc,len,word_count
0,"At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...",1178,179
1,"hello, how are you",18,4
2,welcome to the data science course,34,6

In [126]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [130]:
df['a'][0]

1

In [132]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin